In [1]:
'''
-------------------------------------------
    pandas.pivot()
-------------------------------------------
'''
import pandas as pd

df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

In [2]:
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [3]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [4]:
df.pivot(index='foo', columns='bar')['baz']

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [5]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [6]:
'''
--------------------------------------------------
    pandas.rename()
---------------------------------------------------
'''

df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})

In [7]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [8]:
df.rename(index=str, columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [9]:
df.rename(index=str, columns={"A": "a", "C": "c"})

   a  B
0  1  4
1  2  5
2  3  6

In [10]:
df.rename(str.lower, axis='columns')

   a  b
0  1  4
1  2  5
2  3  6

In [11]:
df.rename({1: 2, 2: 4}, axis='index')

   A  B
0  1  4
2  2  5
4  3  6

In [12]:
'''
-----------------------------------------------------
    pandas.set_index()
-----------------------------------------------------
'''
df = pd.DataFrame({'month': [1, 4, 7, 10],
                    'year': [2012, 2014, 2013, 2014],
                    'sale': [55, 40, 84, 31]})

In [13]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [14]:
df.set_index('month')

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [15]:
df.set_index(['year', 'month'])

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

In [16]:
df.set_index([pd.Index([1, 2, 3, 4]), 'year'])

        month  sale
  year
1 2012      1    55
2 2014      4    40
3 2013      7    84
4 2014     10    31

In [17]:
s = pd.Series([1, 2, 3, 4])

In [18]:
df.set_index([s, s**2])

      month  year  sale
1 1       1  2012    55
2 4       4  2014    40
3 9       7  2013    84
4 16     10  2014    31

In [19]:
'''
-------------------------------------------------
    pandas.merge()
-------------------------------------------------
'''
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]})

In [20]:
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'], 'value': [5, 6, 7, 8]})

In [21]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [22]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [23]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [24]:
df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

In [25]:
'''
-----------------------------------------
 pandas.iloc()
 ----------------------------------------
'''
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]

In [26]:
df = pd.DataFrame(mydict)

In [27]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [28]:
type(df.iloc[0])

pandas.core.series.Series

In [32]:
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [33]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [30]:
df.iloc[1]

a    100
b    200
c    300
d    400
Name: 1, dtype: int64

In [34]:
df.iloc[[1]]

     a    b    c    d
1  100  200  300  400

In [31]:
df.iloc[2]

a    1000
b    2000
c    3000
d    4000
Name: 2, dtype: int64

In [36]:
df.iloc[[2]]

      a     b     c     d
2  1000  2000  3000  4000

In [37]:
df.iloc[[0, 1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [39]:
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [40]:
df.iloc[[True, False, True]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [43]:
df.iloc[lambda x: x.index % 2 == 0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [44]:
df.iloc[0, 1]

2

In [45]:
df.iloc[[0, 2], [1, 3]]

      b     d
0     2     4
2  2000  4000

In [46]:
df.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

In [47]:
df.iloc[:, [True, False, True, False]]

      a     c
0     1     3
1   100   300
2  1000  3000

In [48]:
df.iloc[:, lambda df: [0, 2]]

      a     c
0     1     3
1   100   300
2  1000  3000

In [ ]:
'''
----------------------------------------------------
    pandas.loc()
----------------------------------------------------
'''